basic_stop = {'без', 'безо', 'близ', 'в', 'во', 'вместо', 'вне',
        'для', 'до', 'за', 'из', 'изо', 'из-за', 'из-под',
        'к', 'ко', 'кроме', 'между', 'меж', 'на', 'над', 'надо',
        'о', 'об', 'обо', 'от', 'ото', 'перед', 'передо', 'пред', 'предо',
        'по', 'под', 'подо', 'при', 'про', 'ради', 'с', 'со',
        'сквозь', 'среди', 'у', 'через', 'чрез', 'и', 'или', 'же'}

manual_stop = {'есть', 'ну', 'тогда', 'мочь', 'она', 'себя', 'нельзя', 'если',
    'они', 'только', 'весь', 'разве', 'чтобы', 'теперь', 'потом', 'будто',
    'один', 'что', 'ведь', 'так', 'но', 'ты', 'то', 'ничто', 'нет', 'два',
    'быть', 'совсем', 'тут', 'куда', 'чтоб', 'иногда', 'можно', 'раз', 'чем',
    'тоже', 'всего', 'мой', 'нибыть', 'бы', 'сейчас', 'он', 'такой', 'впрочем',
    'после', 'зачем', 'ни', 'сам', 'вдруг', 'много', 'это', 'когда', 'уже',
    'конечно', 'три', 'тот', 'где', 'я', 'потому', 'уж', 'а', 'ещё', 'опять',
    'какой', 'вы', 'кто', 'всегда', 'здесь', 'нея', 'там', 'чуть', 'вот', 'ли',
    'хоть', 'большой', 'свой', 'более', 'почти', 'никогда', 'наконец', 'как',
    'имя', 'мы', 'тем', 'другой', 'да', 'даже', 'этот', 'ж'}